## Terraform Plan Result
```
Acquiring state lock. This may take a few moments...
module.acm_us.aws_acm_certificate.acm: Refreshing state... [id=arn:aws:acm:us-east-1:695394391597:certificate/a9fbf001-891a-4cef-a36a-137fc00982d3]
module.vpc.aws_eip.nat_eip: Refreshing state... [id=eipalloc-0fb99ae2a8946f49f]
module.iam.aws_iam_policy.ec2_policy: Refreshing state... [id=arn:aws:iam::695394391597:policy/testapp-dev-ec2-policy]
module.s3_cdn.aws_s3_bucket.bucket: Refreshing state... [id=testapp-dev-cdn-images]
module.iam.aws_iam_role.ec2_role: Refreshing state... [id=testapp-dev-ec2-role]
module.cdn.aws_cloudfront_origin_access_control.oac: Refreshing state... [id=EPHGQ65P5I5H3]
module.iam.data.aws_iam_policy_document.ecs_task_assume_role: Reading...
module.acm_tokyo.aws_acm_certificate.acm: Refreshing state... [id=arn:aws:acm:ap-northeast-1:695394391597:certificate/4771d50a-a21b-4e33-96ab-d9384eabaed0]
module.vpc.aws_vpc.vpc: Refreshing state... [id=vpc-0100755a9a690efaf]
module.ecr.aws_ecr_repository.app: Refreshing state... [id=testapp-dev-app]
module.iam.data.aws_iam_policy_document.ecs_task_assume_role: Read complete after 0s [id=1077804475]
module.route53.aws_route53_zone.host_zone: Refreshing state... [id=Z10422823OIO09IXUQOJY]
module.iam.aws_iam_role.ecs_execution_role: Refreshing state... [id=testapp-dev-ecs-execution-role]
module.iam.aws_iam_role.ecs_task_role: Refreshing state... [id=testapp-dev-ecs-task-role]
module.acm_us.aws_route53_record.validation["cdn.manno-cloud.com"]: Refreshing state... [id=Z10422823OIO09IXUQOJY__18c801d97200c67cd00b5640210f275f.cdn.manno-cloud.com._CNAME]
module.iam.aws_iam_role_policy_attachment.ec2_role_attach: Refreshing state... [id=testapp-dev-ec2-role-20251126001734105100000001]
module.waf.aws_wafv2_web_acl.waf: Refreshing state... [id=c7db2502-5706-46f7-ac86-db01e332e292]
module.iam.aws_iam_instance_profile.ec2_profile: Refreshing state... [id=testapp-dev-ec2-profile]
module.iam.aws_iam_role_policy_attachment.ecs_execution_policy: Refreshing state... [id=testapp-dev-ecs-execution-role-20251125033953243700000004]
module.acm_us.aws_acm_certificate_validation.validation: Refreshing state... [id=2025-11-25 06:51:32.695 +0000 UTC]
module.acm_tokyo.aws_route53_record.validation["manno-cloud.com"]: Refreshing state... [id=Z10422823OIO09IXUQOJY__9571c6d4a5b6176de55f37435bc2f971.manno-cloud.com._CNAME]
module.acm_tokyo.aws_acm_certificate_validation.validation: Refreshing state... [id=2025-11-25 03:40:11.593 +0000 UTC]
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-0732d070dfe1ac901]
module.alb_ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:targetgroup/testapp-ecs-tg/86ad2850f986f1ae]
module.vpc.aws_subnet.private["private2"]: Refreshing state... [id=subnet-08072bdee61e4cfca]
module.vpc.aws_subnet.public["public1"]: Refreshing state... [id=subnet-0b410e928a4f8b452]
module.vpc.aws_subnet.public["public3"]: Refreshing state... [id=subnet-0d01b3a7ca22c3a00]
module.vpc.aws_subnet.private["private1"]: Refreshing state... [id=subnet-0f8e7b2812d514c67]
module.vpc.aws_subnet.private["private3"]: Refreshing state... [id=subnet-0e2287ae04d8b75de]
module.vpc.aws_subnet.public["public2"]: Refreshing state... [id=subnet-04b9d03f4ad4d4f12]
module.security_group.aws_security_group.security_group["rds_sg"]: Refreshing state... [id=sg-02da0b0f220f3b7b8]
module.security_group.aws_security_group.security_group["vpc_endpoint_sg"]: Refreshing state... [id=sg-00c80e16924ec86c5]
module.security_group.aws_security_group.security_group["alb_sg"]: Refreshing state... [id=sg-016e60b55a577dad5]
module.security_group.aws_security_group.security_group["ec2_sg"]: Refreshing state... [id=sg-0abea8bfafea3b3e8]
module.security_group.aws_security_group.security_group["ecs_sg"]: Refreshing state... [id=sg-045f70f8e062df016]
module.alb.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:targetgroup/testapp-tg/013c8186eb4a3338]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-052b4fa0a2bcec82c]
module.s3_cdn.aws_s3_bucket_policy.policy: Refreshing state... [id=testapp-dev-cdn-images]
module.s3_cdn.aws_s3_bucket_public_access_block.access_block: Refreshing state... [id=testapp-dev-cdn-images]
module.vpc.aws_nat_gateway.nat: Refreshing state... [id=nat-048eaee1faaa02d8b]
module.rds.aws_db_subnet_group.db_subnet_group: Refreshing state... [id=testapp-dev-db-subnet-group]
aws_security_group_rule.allow_ec2_to_rds: Refreshing state... [id=sgrule-3308883079]
aws_security_group_rule.allow_alb_to_ec2: Refreshing state... [id=sgrule-1404048102]
module.asg.aws_launch_template.lt: Refreshing state... [id=lt-06b974110cb041e57]
aws_security_group_rule.alb_ingress_http: Refreshing state... [id=sgrule-1844001120]
aws_security_group_rule.ecs_egress: Refreshing state... [id=sgrule-967246809]
module.vpc_endpoint.aws_vpc_endpoint.interface["ec2messages"]: Refreshing state... [id=vpce-045d3c7df4a438353]
module.vpc_endpoint.aws_vpc_endpoint.interface["ecr.dkr"]: Refreshing state... [id=vpce-012ffc486120d8622]
module.vpc_endpoint.aws_vpc_endpoint.interface["logs"]: Refreshing state... [id=vpce-03995ef94cf3f83f1]
module.vpc_endpoint.aws_vpc_endpoint.interface["ssm"]: Refreshing state... [id=vpce-04be80a05b9300d5d]
module.vpc_endpoint.aws_vpc_endpoint.interface["ssmmessages"]: Refreshing state... [id=vpce-0153a0f139e3817c7]
module.vpc_endpoint.aws_vpc_endpoint.interface["ecr.api"]: Refreshing state... [id=vpce-0a669864219adab1b]
module.vpc_endpoint.aws_vpc_endpoint.interface["events"]: Refreshing state... [id=vpce-0ce8877b93f8c3299]
module.vpc_endpoint.aws_vpc_endpoint.interface["monitoring"]: Refreshing state... [id=vpce-09a3cca61d030e9ce]
module.vpc_endpoint.aws_vpc_endpoint.interface["sts"]: Refreshing state... [id=vpce-0bf3695793d82ea4a]
aws_security_group_rule.vpc_endpoint_egress: Refreshing state... [id=sgrule-753567340]
aws_security_group_rule.alb_to_ec2: Refreshing state... [id=sgrule-723141613]
aws_security_group_rule.allow_alb_to_ecs: Refreshing state... [id=sgrule-2445353537]
aws_security_group_rule.ec2_egress: Refreshing state... [id=sgrule-1474340581]
aws_security_group_rule.alb_ingress_https: Refreshing state... [id=sgrule-2631658676]
module.alb_ecs.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:loadbalancer/app/testapp-ecs-alb/f4cfed8738e7431b]
aws_security_group_rule.vpc_endpoint_ingress: Refreshing state... [id=sgrule-1350490847]
module.alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:loadbalancer/app/testapp-alb/839a7e611127a069]
module.vpc.aws_route_table_association.public["public1"]: Refreshing state... [id=rtbassoc-0a63dbb592a66e3d3]
module.vpc.aws_route_table_association.public["public2"]: Refreshing state... [id=rtbassoc-0525cad942dc546d4]
module.vpc.aws_route_table_association.public["public3"]: Refreshing state... [id=rtbassoc-097f75dbd4a5b7bcf]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-00f9c363f49bd47db]
module.rds.aws_db_instance.dbinstance: Refreshing state... [id=db-YUR5TQQQYN7W753Y6NMN6VWLFI]
module.asg.aws_autoscaling_group.asg: Refreshing state... [id=testapp-dev-asg]
module.cdn.aws_cloudfront_distribution.cdn: Refreshing state... [id=E2AR0E7A0B28C6]
module.vpc.aws_route_table_association.private["private3"]: Refreshing state... [id=rtbassoc-013b6970ddf217062]
module.vpc.aws_route_table_association.private["private2"]: Refreshing state... [id=rtbassoc-008ef0cea9dbada3a]
module.vpc.aws_route_table_association.private["private1"]: Refreshing state... [id=rtbassoc-012b905d423c4f812]
module.vpc_endpoint.aws_vpc_endpoint.gateway["s3"]: Refreshing state... [id=vpce-02dfb67547a9d4794]
module.vpc_endpoint.aws_vpc_endpoint.gateway["dynamodb"]: Refreshing state... [id=vpce-02f73b599794d44e7]
aws_route53_record.cdn: Refreshing state... [id=Z10422823OIO09IXUQOJY_cdn.manno-cloud.com_A]
aws_route53_record.root: Refreshing state... [id=Z10422823OIO09IXUQOJY_manno-cloud.com_A]
module.alb_ecs.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:listener/app/testapp-ecs-alb/f4cfed8738e7431b/c674636fd93495f0]
module.alb_ecs.aws_lb_listener.http_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:listener/app/testapp-ecs-alb/f4cfed8738e7431b/36f45e0d577232b7]
module.alb.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:listener/app/testapp-alb/839a7e611127a069/6831c8922ba8736f]
module.alb.aws_lb_listener.http_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:listener/app/testapp-alb/839a7e611127a069/13e5d1d1a6bcca33]
module.ecs.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:695394391597:cluster/testapp-dev-cluster]
module.ecs.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:695394391597:cluster/testapp-dev-cluster]
module.ecs.aws_cloudwatch_log_group.ecs: Refreshing state... [id=/ecs/testapp-dev-nginx]
module.ecs.aws_ecr_repository.app: Refreshing state... [id=testapp-dev-nginx]
module.ecs.aws_ecs_task_definition.nginx: Refreshing state... [id=testapp-dev-nginx]
module.ecs.aws_ecs_task_definition.app: Refreshing state... [id=testapp-dev-task]
module.ecs.aws_ecs_service.app: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:695394391597:service/testapp-dev-cluster/testapp-dev-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.nginx will be created
  + resource "aws_ecs_service" "nginx" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:ap-northeast-1:695394391597:cluster/testapp-dev-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "testapp-dev-svc"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws:ecs:ap-northeast-1:695394391597:task-definition/testapp-dev-nginx:6"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "nginx"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:695394391597:targetgroup/testapp-ecs-tg/86ad2850f986f1ae"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-045f70f8e062df016",
            ]
          + subnets          = [
              + "subnet-08072bdee61e4cfca",
              + "subnet-0e2287ae04d8b75de",
              + "subnet-0f8e7b2812d514c67",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Reference to undefined provider

  on main.tf line 230, in module "acm_tokyo":
 230:     aws = aws

There is no explicit declaration for local provider name "aws" in
module.acm_tokyo, so Terraform is assuming you mean to pass a configuration
for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws" with the source address "hashicorp/aws".

(and 4 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
<!-- Sticky Pull Request Commentterraform-plan -->